# Get the Data Set
Get data sets of CCTV in Seoul and population in Seoul<br/>
http://data.seoul.go.kr/dataList/datasetView.do?infId=OA-2734&srvType=S&serviceKind=1 <br/>
http://data.seoul.go.kr/dataList/datasetView.do?serviceKind=2&infId=419&stcSrl=419&srvType=S

# Load Data

In [1]:
import pandas as pd

In [2]:
cctv_seoul = pd.read_csv('./resource/CCTV_in_Seoul.csv', encoding='utf-8')
cctv_seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [3]:
cctv_seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [4]:
cctv_seoul.columns[0]

'기관명'

In [13]:
cctv_seoul.rename(columns={cctv_seoul.columns[0] : 'Gu',
                           cctv_seoul.columns[1] : 'Subtotal',
                           cctv_seoul.columns[2] : 'Before 2013',
                           cctv_seoul.columns[3] : '2014',
                           cctv_seoul.columns[4] : '2015',
                           cctv_seoul.columns[5] : '2016'}, inplace=True)
cctv_seoul.head()

    Gu  Subtotal  Before 2013  2014  2015  2016
0  강남구      3238         1292   430   584   932
1  강동구      1010          379    99   155   377
2  강북구       831          369   120   138   204
3  강서구       911          388   258   184    81
4  관악구      2109          846   260   390   613

In [10]:
pop_seoul = pd.read_excel('./resource/population_in_Seoul.xls', encoding='utf-8')
pop_seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2018.3/4,합계,4254018,10068381,4922959,5145422,9793003,4789821,5003182,275378,133138,142240,2.3,1405404
3,2018.3/4,종로구,73696,163086,79301,83785,153396,75024,78372,9690,4277,5413,2.08,26622
4,2018.3/4,중구,61232,135258,66554,68704,125815,62063,63752,9443,4491,4952,2.05,21902

In [11]:
pop_seoul = pd.read_excel('./resource/population_in_Seoul.xls', 
                          header=2, #read from row 3
                          parse_cols = 'B,D,G,J,N', #read B,D,G,J,N cols
                          encoding='utf-8') 
pop_seoul.head()

c:\python37\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: the 'parse_cols' keyword is deprecated, use 'usecols' instead
  after removing the cwd from sys.path.

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10068381  9793003  275378   1405404
1  종로구    163086   153396    9690     26622
2   중구    135258   125815    9443     21902
3  용산구    245087   229391   15696     37443
4  성동구    317197   309251    7946     42581

In [14]:
pop_seoul.rename(columns={pop_seoul.columns[0] : 'Gu',
                          pop_seoul.columns[1] : 'Population',
                          pop_seoul.columns[2] : 'Korean',
                          pop_seoul.columns[3] : 'Foreigner',
                          pop_seoul.columns[4] : 'Senior'}, inplace=True)
pop_seoul.head()

    Gu  Population   Korean  Foreigner   Senior
0   합계    10068381  9793003     275378  1405404
1  종로구      163086   153396       9690    26622
2   중구      135258   125815       9443    21902
3  용산구      245087   229391      15696    37443
4  성동구      317197   309251       7946    42581

# Basic Concepts of Pandas

In [15]:
#import pandas already done above
import numpy as np

In [16]:
s = pd.Series([1,3,5,np.nan, 6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [24]:
# assign dates using date_range
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [28]:
df = pd.DataFrame(np.random.randn(6,4))
df.index = dates
df.columns = ['A', 'B', 'C', 'D']
df

                   A         B         C         D
2013-01-01  0.145458  0.563245  1.000467 -1.110783
2013-01-02 -0.195629  0.242101 -1.102025 -1.031138
2013-01-03  1.842057 -0.863663 -0.917652  0.219132
2013-01-04 -0.441301  0.227153  0.243672 -1.499411
2013-01-05  1.638924 -1.092599 -0.522876 -0.555932
2013-01-06 -0.190236  0.592828  1.695094 -0.111672

In [29]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [30]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [31]:
df.values

array([[ 0.14545805,  0.56324487,  1.00046709, -1.11078282],
       [-0.19562892,  0.24210077, -1.1020254 , -1.03113792],
       [ 1.84205718, -0.86366269, -0.91765217,  0.21913225],
       [-0.44130067,  0.22715289,  0.24367188, -1.49941084],
       [ 1.63892431, -1.0925991 , -0.52287611, -0.55593197],
       [-0.19023584,  0.5928281 ,  1.69509387, -0.11167182]])

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [33]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.466546 -0.055156  0.066113 -0.681634
std    1.006342  0.734892  1.116904  0.652245
min   -0.441301 -1.092599 -1.102025 -1.499411
25%   -0.194281 -0.590959 -0.818958 -1.090872
50%   -0.022389  0.234627 -0.139602 -0.793535
75%    1.265558  0.482959  0.811268 -0.222737
max    1.842057  0.592828  1.695094  0.219132

## Sort

In [34]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-06 -0.190236  0.592828  1.695094 -0.111672
2013-01-01  0.145458  0.563245  1.000467 -1.110783
2013-01-02 -0.195629  0.242101 -1.102025 -1.031138
2013-01-04 -0.441301  0.227153  0.243672 -1.499411
2013-01-03  1.842057 -0.863663 -0.917652  0.219132
2013-01-05  1.638924 -1.092599 -0.522876 -0.555932

In [35]:
df

                   A         B         C         D
2013-01-01  0.145458  0.563245  1.000467 -1.110783
2013-01-02 -0.195629  0.242101 -1.102025 -1.031138
2013-01-03  1.842057 -0.863663 -0.917652  0.219132
2013-01-04 -0.441301  0.227153  0.243672 -1.499411
2013-01-05  1.638924 -1.092599 -0.522876 -0.555932
2013-01-06 -0.190236  0.592828  1.695094 -0.111672

## Slicing

In [36]:
# row 0:3
df[0:3]

                   A         B         C         D
2013-01-01  0.145458  0.563245  1.000467 -1.110783
2013-01-02 -0.195629  0.242101 -1.102025 -1.031138
2013-01-03  1.842057 -0.863663 -0.917652  0.219132

In [37]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.195629  0.242101 -1.102025 -1.031138
2013-01-03  1.842057 -0.863663 -0.917652  0.219132
2013-01-04 -0.441301  0.227153  0.243672 -1.499411

In [38]:
df.loc[dates[0]]

A    0.145458
B    0.563245
C    1.000467
D   -1.110783
Name: 2013-01-01 00:00:00, dtype: float64

In [39]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.145458  0.563245
2013-01-02 -0.195629  0.242101
2013-01-03  1.842057 -0.863663
2013-01-04 -0.441301  0.227153
2013-01-05  1.638924 -1.092599
2013-01-06 -0.190236  0.592828

In [40]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.195629  0.242101
2013-01-03  1.842057 -0.863663
2013-01-04 -0.441301  0.227153